JuulLabs/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_i2c.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <string.h>
#include <errno.h>
#include <limits.h>
#include <assert.h>
#include "os/mynewt.h"
#include <mcu/cmsis_nvic.h>
#include <hal/hal_i2c.h>
#include <hal/hal_gpio.h>
#include <mcu/nrf52_hal.h>
#include "nrf_twim.h"
#include <console/console.h>

#include <nrf.h>

typedef void (*nrf52_i2c_irq_handler_t)(void);


#if 0
volatile int my_dbg_stop = 0;
int waitfor_my_dbg(uint32_t timeout)
{
    os_time_t now;
    uint32_t start;
    start = os_time_get();
    while (!my_dbg_stop)
    {
        now = os_time_get();
        if (OS_TIME_TICK_GT(now, start + timeout)) {
            return -1;
        }
    }
    return 0;
}

void clear_my_dbg(void)
{
    my_dbg_stop = 0;
}

void set_my_dbg(void)
{
    my_dbg_stop = 1;
}
#else
static struct os_sem my_dbg_sem;
int waitfor_my_dbg(uint32_t timeout)
{
    if (os_sem_pend(&my_dbg_sem, timeout) == OS_TIMEOUT)
    {
        return -1;
    }
    return 0;
}
void clear_my_dbg(void)
{
    if (os_sem_init(&my_dbg_sem, 0) != OS_OK) {
        assert(0);
    }
}
void set_my_dbg(void)
{
    if (os_sem_release(&my_dbg_sem) != OS_OK) {
        assert(0);
    }
}
#endif


#define I2C_WRITE 0
#define I2C_READ  1

#define NRF52_HAL_I2C_MAX (2)

#define NRF52_SCL_PIN_CONF                                              \
    ((GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos) |          \
      (GPIO_PIN_CNF_DRIVE_S0D1    << GPIO_PIN_CNF_DRIVE_Pos) |          \
      (GPIO_PIN_CNF_PULL_Pullup   << GPIO_PIN_CNF_PULL_Pos) |           \
      (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos) |          \
      (GPIO_PIN_CNF_DIR_Input     << GPIO_PIN_CNF_DIR_Pos))
#define NRF52_SDA_PIN_CONF NRF52_SCL_PIN_CONF

#define NRF52_SCL_PIN_CONF_CLR                                  \
     ((GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos) | \
      (GPIO_PIN_CNF_DRIVE_S0D1     << GPIO_PIN_CNF_DRIVE_Pos) | \
      (GPIO_PIN_CNF_PULL_Pullup    << GPIO_PIN_CNF_PULL_Pos)  | \
      (GPIO_PIN_CNF_INPUT_Connect  << GPIO_PIN_CNF_INPUT_Pos) | \
      (GPIO_PIN_CNF_DIR_Output     << GPIO_PIN_CNF_DIR_Pos))
#define NRF52_SDA_PIN_CONF_CLR    NRF52_SCL_PIN_CONF_CLR

struct nrf52_hal_i2c {
    NRF_TWIM_Type *nhi_regs;
    uint32_t freq;
    uint32_t irq_number;
    nrf52_i2c_irq_handler_t irq_handler;
    volatile int last_error;
    void (* take_sem_cb)(void);
    void (* release_sem_cb)(void);
    int (* pend_sem_cb)(uint32_t timeout_ticks);
};
//static void hal_i2c_irq_handler(NRF_TWIM_Type *regs);
static void hal_i2c_irq_handler(struct nrf52_hal_i2c *i2c);



#if MYNEWT_VAL(I2C_0)
void i2c0_irq_handler(void);
struct nrf52_hal_i2c hal_twi_i2c0 = {
    .nhi_regs = NRF_TWIM0,
    .irq_number = SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn,
    .irq_handler = i2c0_irq_handler
};

void
i2c0_irq_handler(void)
{
    os_trace_isr_enter();
    hal_i2c_irq_handler(&hal_twi_i2c0);
    os_trace_isr_exit();
}
#endif

#if MYNEWT_VAL(I2C_1)
void i2c1_irq_handler(void);
struct nrf52_hal_i2c hal_twi_i2c1 = {
    .nhi_regs = NRF_TWIM1,
    .irq_number = SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn,
    .irq_handler = i2c1_irq_handler
};

void
i2c1_irq_handler(void)
{
    os_trace_isr_enter();
    hal_i2c_irq_handler(&hal_twi_i2c1);
    os_trace_isr_exit();
}
#endif


static struct nrf52_hal_i2c *nrf52_hal_i2cs[NRF52_HAL_I2C_MAX] = {
#if MYNEWT_VAL(I2C_0)
    &hal_twi_i2c0,
#else
    NULL,
#endif
#if MYNEWT_VAL(I2C_1)
    &hal_twi_i2c1
#else
    NULL
#endif
};

/**
 * Converts an nRF SDK I2C status to a HAL I2C error code.
 */
static int
hal_i2c_convert_status(int nrf_status)
{
    if (nrf_status == 0) {
        return 0;
    } else if (nrf_status & NRF_TWIM_ERROR_DATA_NACK) {
//        console_printf("<>i2c error: DATA_NAK<>\n");
        return HAL_I2C_ERR_DATA_NACK;
    } else if (nrf_status & NRF_TWIM_ERROR_ADDRESS_NACK) {
//        console_printf("<>i2c error: ADDR_NAK<>\n");
        return HAL_I2C_ERR_ADDR_NACK;
    } else if (nrf_status & TWIM_ERRORSRC_OVERRUN_Msk) {
//        console_printf("<>i2c error: OVERRUN<>\n");
        return HAL_I2C_ERR_OVERRUN;
    } else {
//        console_printf("<>i2c error: UNKNOWN<>\n");
        return HAL_I2C_ERR_UNKNOWN;
    }
}

static void
hal_i2c_delay_us(uint32_t number_of_us)
{
register uint32_t delay __ASM ("r0") = number_of_us;
__ASM volatile (
#ifdef NRF51
        ".syntax unified\n"
#endif
    "1:\n"
    " SUBS %0, %0, #1\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
#ifdef NRF52
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
#endif
    " BNE 1b\n"
#ifdef NRF51
    ".syntax divided\n"
#endif
    : "+r" (delay));
}

static int
hal_i2c_resolve(uint8_t i2c_num, struct nrf52_hal_i2c **out_i2c)
{
    if (i2c_num >= NRF52_HAL_I2C_MAX) {
        *out_i2c = NULL;
        return HAL_I2C_ERR_INVAL;
    }

    *out_i2c = nrf52_hal_i2cs[i2c_num];
    if (*out_i2c == NULL) {
        return HAL_I2C_ERR_INVAL;
    }

