JuulLabs/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_i2c.c
/*
 * Starts an I2C transaction either read or write using EasyDMA/TWIM
 */
static int
hal_i2c_handle_transact_start(struct nrf52_hal_i2c *i2c, uint8_t op,
                              os_time_t abs_timo, uint8_t address)
{
    NRF_TWIM_Type *regs;
#if MYNEWT_VAL(NRF52_HANDLE_ANOMALY_109)
    os_time_t now;
#endif
    int rc=0;

    regs = i2c->nhi_regs;

    regs->EVENTS_ERROR = 0;
    regs->EVENTS_STOPPED = 0;

    /* If a transaction was previously suspended, resume it */
    if (regs->EVENTS_SUSPENDED) {
        regs->TASKS_RESUME = 1;
        regs->EVENTS_SUSPENDED = 0;
        return rc;
    }

    if (op == I2C_WRITE) {
        /* Start an I2C transmit transaction */
        regs->TASKS_STARTTX = 1;

#if MYNEWT_VAL(NRF52_HANDLE_ANOMALY_109)
        while (!regs->EVENTS_TXSTARTED) {
            now = os_time_get();
            if (OS_TIME_TICK_GT(now, abs_timo)) {
                rc = HAL_I2C_ERR_TIMEOUT;
                return rc;
            }
        }

        regs->EVENTS_TXSTARTED = 0;
        if (!regs->FREQUENCY) {
            hal_i2c_handle_anomaly_109(regs, i2c->freq, address);
            regs->EVENTS_TXSTARTED = 0;
        }
#endif
    } else {
        if (!regs->FREQUENCY) {
            regs->FREQUENCY = i2c->freq;
        }
        /* Start an I2C receive transaction */
        regs->TASKS_STARTRX = 1;
    }

    return 0;
}

os_time_t g_start;

#if 0
static int
hal_i2c_handle_transact_end(NRF_TWIM_Type *regs, uint8_t op, uint32_t start,
                            os_time_t abs_timo, uint8_t last_op)
{
    int rc;
    volatile uint32_t *evt;
    volatile os_time_t now = 0;

    /*
     * Use last_op as the determining factor for the type of event to be
     * monitored
     */
    if (last_op) {
        evt = &regs->EVENTS_STOPPED;
    } else {
        evt = &regs->EVENTS_SUSPENDED;
    }

    /* since there is no SUSPEND short for RX, we have to specifically
     * deal with it
     */
    if (op == I2C_READ && !last_op) {
        while (!regs->EVENTS_LASTRX) {
            now = os_time_get();
            if (OS_TIME_TICK_GT(now, abs_timo)) {
                rc = HAL_I2C_ERR_TIMEOUT;
                goto err;
            }
        }
        regs->TASKS_SUSPEND = 1;
    }

    while(1) {
        if (*evt) {
            if (evt == &regs->EVENTS_STOPPED) {
#if MYNEWT_VAL(NRF52_HANDLE_ANOMALY_109)
                if (regs->FREQUENCY) {
                    regs->FREQUENCY = 0;
                }
#endif
            }
            break;
        }

        if (regs->EVENTS_ERROR) {
            goto err;
        }

        now = os_time_get();
        if (OS_TIME_TICK_GT(now, abs_timo)) {
            rc = HAL_I2C_ERR_TIMEOUT;
            goto err;
        }
    }
    regs->TASKS_RESUME  = 1;

    g_start = os_cputime_get32() - g_start;

    //console_printf("t:%lu r:%u\n", g_start, op);

    return 0;
err:
    console_printf("i2c failure: rc:%u evt_stopped: %lu evt_suspended: %lu\n",
                   rc, regs->EVENTS_STOPPED, regs->EVENTS_SUSPENDED);
    return rc;
}
#endif

/* Handle errors returned from the TWIM peripheral along with timeouts */
static int
hal_i2c_handle_errors(struct nrf52_hal_i2c *i2c, int rc, os_time_t abs_timo)
{
    int nrf_status;
    NRF_TWIM_Type *regs;

    regs = i2c->nhi_regs;

    regs->TASKS_RESUME = 1;
    regs->TASKS_STOP = 1;

    if (regs->EVENTS_ERROR) {
        regs->EVENTS_ERROR = 0;
        nrf_status = regs->ERRORSRC;
        regs->ERRORSRC = nrf_status;
        rc = hal_i2c_convert_status(nrf_status);
    } else if (rc) {
        /* Some I2C slave peripherals cause a glitch on the bus when they
         * reset which puts the TWI in an unresponsive state. Disabling and
         * re-enabling the TWI returns it to normal operation.
         * A clear operation is performed in case one of the devices on
         * the bus is in a bad state.
         */
        regs->ENABLE = TWIM_ENABLE_ENABLE_Disabled;
        hal_i2c_clear_bus(regs->PSEL.SCL, regs->PSEL.SDA);
        regs->ENABLE = TWIM_ENABLE_ENABLE_Enabled;
        regs->EVENTS_STOPPED = 0;
    }

    return rc;
}

os_time_t g_start;

/* Perform I2C master writes using TWIM/EasyDMA */
int
hal_i2c_master_write(uint8_t i2c_num, struct hal_i2c_master_data *pdata,
                     uint32_t timo, uint8_t last_op)
{
    int rc;
//    os_time_t now;
    uint32_t start;
    NRF_TWIM_Type *regs;
    struct nrf52_hal_i2c *i2c;

    start = os_time_get();
    g_start = os_cputime_get32();

    /* Resolve the I2C bus */
    rc = hal_i2c_resolve(i2c_num, &i2c);
    if (rc != 0) {
        return rc;
    }

    regs = i2c->nhi_regs;

    /*
     * Configure the TXD registers for EasyDMA access to work with buffers of
     * specific length and address of the slave
     */
    regs->ADDRESS    = pdata->address;
    regs->TXD.MAXCNT = pdata->len;
    regs->TXD.PTR    = (uint32_t)pdata->buffer;
    regs->TXD.LIST   = 0;

    /* Disable and clear interrupts */
    regs->INTENCLR   = NRF_TWIM_ALL_INTS_MASK;
    regs->INTEN      = 0;

    /* Setup shorts to end transaction based on last_op,
     * 0 : STOP transaction,
     * 1 : SUSPEND transaction
     */
    if (last_op)
    {
        /* Enable short for LASTX->STOP */
        regs->SHORTS = TWIM_SHORTS_LASTTX_STOP_Msk;
    } else
    {
        /* Enable short for LASTX->SUSPEND */
        regs->SHORTS = TWIM_SHORTS_LASTTX_SUSPEND_Msk;
    }

    i2c->last_error = 0;

    assert (i2c->take_sem_cb != NULL);
    i2c->take_sem_cb();

    /* Starts an I2C transaction using TWIM/EasyDMA */
    rc = hal_i2c_handle_transact_start(i2c, I2C_WRITE, start + timo, pdata->address);
    if (rc) {
        goto err;
    }
#if 0
    /* Ends an I2C transaction using TWIM/EasyDMA */
    rc = hal_i2c_handle_transact_end(regs, I2C_WRITE, start, start + timo, last_op);
    if (rc) {
        goto err;
    }

#endif

    // Enable interrupts for STOPPED and ERROR
    regs->INTENSET = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;

    assert(i2c->pend_sem_cb != NULL);
    if (i2c->pend_sem_cb(timo) != 0)
    {
        rc = HAL_I2C_ERR_TIMEOUT;
        console_printf("<>wr timeout: a=%x<>\n",pdata->address);
        goto err;
    }
#if 0
    while (!my_dbg_stop) {
        now = os_time_get();
        if (OS_TIME_TICK_GT(now, start + timo)) {
            rc = HAL_I2C_ERR_TIMEOUT;
            console_printf("<>wr timeout: a=%x<>\n",pdata->address);
            goto err;
        }
    }
#endif

//    console_printf("<>wr stop a=%x, reg=%x<>\n", pdata->address, pdata->buffer[0]);
    rc = i2c->last_error;
    if (rc != 0)
    {
        goto err;
    }
    return 0;
err:
    return hal_i2c_handle_errors(i2c, rc, start + timo);
}

int
hal_i2c_master_read(uint8_t i2c_num, struct hal_i2c_master_data *pdata,
                    uint32_t timo, uint8_t last_op)
{
    int rc;
    uint32_t start;
    NRF_TWIM_Type *regs;
    struct nrf52_hal_i2c *i2c;

    start = os_time_get();
    g_start = os_cputime_get32();

