JuulLabs/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_i2c.c
    /* Resolve the I2C bus */
    rc = hal_i2c_resolve(i2c_num, &i2c);
    if (rc != 0) {
        return rc;
    }

    regs = i2c->nhi_regs;

    /*
     * Configure the RXD registers for EasyDMA access to work with buffers of
     * specific length and address of the slave
     */
    regs->ADDRESS    = pdata->address;
    regs->RXD.MAXCNT = pdata->len;
    regs->RXD.PTR    = (uint32_t)pdata->buffer;
    regs->RXD.LIST   = 0;

    /* Disable and clear interrupts */
    regs->INTENCLR   = NRF_TWIM_ALL_INTS_MASK;
    regs->INTEN      = 0;

    /*
     * Only set short for RX->STOP for last_op:1 since there is no suspend short
     * available in nrf52832
     */
    if (last_op)
    {
        regs->SHORTS = TWIM_SHORTS_LASTRX_STOP_Msk;
    }
    else
    {
        regs->SHORTS = 0;
    }

    console_printf("<>rd a=%x<>\n", pdata->address);

    /* Starts an I2C transaction using TWIM/EasyDMA */
    rc = hal_i2c_handle_transact_start(i2c, I2C_READ, start + timo, pdata->address);
    if (rc) {
        goto err;
    }

    if (last_op)
    {
        /* Enable interrupts for STOPPED and ERROR */
        regs->INTENSET = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;
    }
    else
    {
        /* Enable interrupts for LASTRX and ERROR */
        regs->INTENSET = NRF_TWIM_INT_LASTRX_MASK | NRF_TWIM_INT_ERROR_MASK;
    }

#if 0
    /* Ends an I2C transaction using TWIM/EasyDMA */
    rc = hal_i2c_handle_transact_end(regs, I2C_READ, start, start + timo, last_op);
    if (rc) {
        goto err;
    }
#endif


    return 0;
err:
    return hal_i2c_handle_errors(i2c, rc, start + timo);
}


int
hal_i2c_master_write_read(uint8_t i2c_num, struct hal_i2c_master_data *pdata, uint32_t timo)
{
    int rc;
//    os_time_t now;
    uint32_t start;
    NRF_TWIM_Type *regs;
    struct nrf52_hal_i2c *i2c;

    /* Resolve the I2C bus */
    rc = hal_i2c_resolve(i2c_num, &i2c);
    if (rc != 0) {
        console_printf("<>resolve failed<>\n");
        return rc;
    }

    regs = i2c->nhi_regs;

    // todo: find out why Nordic SDK clears events w dummy read for cortex-m4 only:
    //nrf_twim_event_clear(regs, NRF_TWIM_EVENT_STOPPED);
    //nrf_twim_event_clear(regs, NRF_TWIM_EVENT_ERROR);

    /*
     * Configure the TXD and RXD registers for EasyDMA access to work with buffers of
     * specific length and address of the slave
     */
    regs->ADDRESS    = pdata->address;
    regs->TXD.MAXCNT = pdata->len1;
    regs->TXD.PTR    = (uint32_t)pdata->buffer1;
    regs->TXD.LIST   = 0;
    regs->RXD.MAXCNT = pdata->len2;
    regs->RXD.PTR    = (uint32_t)pdata->buffer2;
    regs->RXD.LIST   = 0;

    /* Disable and clear interrupts */
    regs->INTENCLR   = NRF_TWIM_ALL_INTS_MASK;
    regs->INTEN      = 0;

    // probably not needed here
    // todo: add anomaly 109 handling
    if (!regs->FREQUENCY) {
        regs->FREQUENCY = i2c->freq;
    }

    /* Enable 2 shorts: LASTTX->STARTRX and LASTRX->STOP */
    regs->SHORTS = TWIM_SHORTS_LASTTX_STARTRX_Msk | TWIM_SHORTS_LASTRX_STOP_Msk;

    i2c->last_error = 0;

    assert (i2c->take_sem_cb != NULL);
    i2c->take_sem_cb();

    regs->EVENTS_ERROR = 0;
    regs->EVENTS_STOPPED = 0;
    regs->EVENTS_SUSPENDED = 0;
    regs->TASKS_RESUME  = 1;
    regs->TASKS_STARTTX = 1;

    /* Enable interrupts for STOPPED and ERROR */
    regs->INTENSET = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;

    // note: some anomaly 109 workaround stuff would go here

    start = os_time_get();
    g_start = os_cputime_get32();

    assert(i2c->pend_sem_cb != NULL);
    if (i2c->pend_sem_cb(timo) != 0)
    {
        rc = HAL_I2C_ERR_TIMEOUT;
        console_printf("<>wrrd timeout: a=%x<>\n",pdata->address);
        goto err;
    }
#if 0
// todo: fall back to blocking if semaphore callbacks not set
    else
    {
        /* Blocking */
        while (!my_dbg_stop)
        {
            now = os_time_get();
            if (OS_TIME_TICK_GT(now, start + timo)) {
                rc = HAL_I2C_ERR_TIMEOUT;
                console_printf("<>wrrd timeout: a=%x<>\n",pdata->address);
                goto err;
            }

        }
    }
#endif

//    console_printf("<>wrrd stop a=%x r=%x<>\n", pdata->address, pdata->buffer1[0]);
    rc = i2c->last_error;
    if (rc != 0)
    {
        goto err;
    }
    return 0;
err:
    return hal_i2c_handle_errors(i2c, rc, start + timo);
}


int
hal_i2c_master_probe(uint8_t i2c_num, uint8_t address, uint32_t timo)
{
    struct hal_i2c_master_data rx;
    uint8_t buf;

    rx.address = address;
    rx.buffer = &buf;
    rx.len = 1;

    return hal_i2c_master_read(i2c_num, &rx, timo, 1);
}

#if 0
static void nrf_twim_event_clear(NRF_TWIM_Type * p_reg,
                                          uint32_t event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0x0UL;
#if __CORTEX_M == 0x04
    volatile uint32_t dummy = *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event));
    (void)dummy;
#endif
}
#endif

static void
hal_i2c_irq_handler(struct nrf52_hal_i2c *i2c)
{
    NRF_TWIM_Type *regs;
    regs = i2c->nhi_regs;
    if (regs->EVENTS_ERROR)
    {
        nrf_twim_event_clear(regs, NRF_TWIM_EVENT_ERROR);
        /*
         * If STOP hasn't occurred, trigger one now. The error
         * source will be processed at the end of this handler,
         * when the STOP interrupt takes place.
         */
        if (!regs->EVENTS_STOPPED)
        {
            /* Enable only the STOPPED event interrupt */
            regs->INTENCLR = NRF_TWIM_ALL_INTS_MASK;
            regs->INTENSET = NRF_TWIM_INT_STOPPED_MASK;
            regs->TASKS_RESUME = 1;
            regs->TASKS_STOP = 1;
            return;
        }
    }

    if (regs->EVENTS_STOPPED)
    {
        nrf_twim_event_clear(regs, NRF_TWIM_EVENT_STOPPED);
        nrf_twim_event_clear(regs, NRF_TWIM_EVENT_LASTTX);
        nrf_twim_event_clear(regs, NRF_TWIM_EVENT_LASTRX);
        assert(i2c->release_sem_cb != NULL);
        i2c->release_sem_cb();

    }
#if 0
    else
    {
        if (regs->EVENTS_LASTRX)
        {
            /* Handle LASTRX event */
            nrf_twim_event_clear(regs, NRF_TWIM_EVENT_LASTRX);
            regs->TASKS_SUSPEND = 1;

        }
        else {
            /* Handle SUSPEND event */
            nrf_twim_event_clear(regs, NRF_TWIM_EVENT_SUSPENDED);
            regs->SHORTS = TWIM_SHORTS_LASTTX_STOP_Msk;
            /* Enable STOPPED and ERROR event interrupts */
            regs->INTENCLR = NRF_TWIM_ALL_INTS_MASK;
            regs->INTENSET = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;
            regs->TASKS_STARTTX = 1;
            regs->TASKS_RESUME = 1;

    }
#endif
    /* Read and clear error source register */
    uint32_t errorsrc = regs->ERRORSRC;
    regs->ERRORSRC = errorsrc;
    i2c->last_error = hal_i2c_convert_status(errorsrc);
}
